app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def edit
    @article = Article.find_by(params[:id])

SELECT  "articles".* FROM "articles" WHERE (1) LIMIT ?  [["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-09-30 21:16:52.843500"], ["id", 1]]
---
  def update
    @article = Article.find_by(params[:id])
    @article.update(title: params[:article][:title], description: params[:article][:description])